package persianvalidator

var (
	Characters = map[rune]rune{
		'ء': 1569,
		'آ': 1570,
		'أ': 1571,
		'ؤ': 1572,
		'إ': 1573,
		'ئ': 1574,
		'ا': 1575,
		'ب': 1576,
		'ت': 1578,
		'ث': 1579,
		'ج': 1580,
		'ح': 1581,
		'خ': 1582,
		'د': 1583,
		'ذ': 1584,
		'ر': 1585,
		'ز': 1586,
		'س': 1587,
		'ش': 1588,
		'ص': 1589,
		'ض': 1590,
		'ط': 1591,
		'ظ': 1592,
		'ع': 1593,
		'غ': 1594,
		'ف': 1601,
		'ق': 1602,
		'ل': 1604,
		'م': 1605,
		'ن': 1606,
		'ه': 1607,
		'و': 1608,
		'َ': 1614,
		'ُ': 1615,
		'ِ': 1616,
		'ّ': 1617,
		'ٕ': 1621,
		'پ': 1662,
		'چ': 1670,
		'ژ': 1688,
		'ک': 1705,
		'گ': 1711,
		'ھ': 1726,
		'ی': 1740,
	}

	Numbers = map[rune]rune{
		'۰': 1776,
		'۱': 1777,
		'۲': 1778,
		'۳': 1779,
		'۴': 1780,
		'۵': 1781,
		'۶': 1782,
		'۷': 1783,
		'۸': 1784,
		'۹': 1785,
	}

	Spaces = map[rune]rune{
		' ': 32,
		' ': 8192,
		' ': 8193,
		' ': 8194,
		' ': 8195,
		' ': 8196,
		' ': 8197,
		' ': 8198,
		' ': 8199,
		' ': 8200,
		' ': 8201,
		' ': 8202,
		'​': 8203,
		'‌': 8204,
		'‍': 8205,
		'‎': 8206,
		'‏': 8207,
		' ': 8232,
		' ': 8233,
		'‪': 8234,
		'‫': 8235,
		'‬': 8236,
		'‭': 8237,
		'‮': 8238,
		' ': 8239,
	}
)

func IsValid(str string) bool {
	charValid := true

	for _, value := range str {
		if !charValid {
			return false
		}

		if _, ok := Characters[value]; ok {
			charValid = true

			continue
		}

		if _, ok := Numbers[value]; ok {
			charValid = true

			continue
		}

		if _, ok := Spaces[value]; ok {
			charValid = true

			continue
		}

		charValid = false
	}

	return charValid
}
